#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

random_id.lambda_functions_bucket_name: Refreshing state... [id=eAl5c8rne0I]
module.dynamodb_table_users.aws_dynamodb_table.dynamoTable: Refreshing state... [id=users-prod]
module.lambda_mask_to_cidr.aws_iam_role.lambda_execution_role: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-prod]
aws_apigatewayv2_api.main: Refreshing state... [id=3rlm858roe]
module.lambda_root.aws_iam_role.lambda_execution_role: Refreshing state... [id=rootFunction-lambda-execution-role-prod]
module.lambda_cidr_to_mask.aws_iam_role.lambda_execution_role: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-prod]
module.lambda_health.aws_iam_role.lambda_execution_role: Refreshing state... [id=healthFunction-lambda-execution-role-prod]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/prod/sre-bootcamp-api]
aws_iam_role.auth_execution_role: Refreshing state... [id=auth-lambda-execution-role-prod]
module.s3_bucket_for_lambda.aws_s3_bucket.bucket: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod]
module.lambda_login.aws_iam_role.lambda_execution_role: Refreshing state... [id=loginFunction-lambda-execution-role-prod]
module.lambda_register.aws_iam_role.lambda_execution_role: Refreshing state... [id=registerFunction-lambda-execution-role-prod]
aws_cloudwatch_log_group.main_api_gw: Refreshing state... [id=/aws/api-gw/sre-bootcamp-api-prod]
module.lambda_cidr_to_mask.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-prod-20230330231317096900000001]
module.lambda_health.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=healthFunction-lambda-execution-role-prod-20230330231317103100000002]
module.lambda_root.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=rootFunction-lambda-execution-role-prod-20230330231317394100000007]
module.lambda_mask_to_cidr.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-prod-20230330231317216000000006]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317113200000004]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::408257009451:policy/jwtSecret_Policy"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317110000000003]
aws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/SecretsManagerReadWrite"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317194300000005]
aws_apigatewayv2_stage.stage: Refreshing state... [id=prod]
aws_iam_policy.dynamoDbLambdaPolicy: Refreshing state... [id=arn:aws:iam::408257009451:policy/dynamoDbLambdaPolicy-prod]
module.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=registerFunction-lambda-execution-role-prod-2023033023132396470000000b]
module.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=registerFunction-lambda-execution-role-prod-2023033023132383640000000a]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-20230330231323811000000008]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[3]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-20230330231323814500000009]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-2023033023132399720000000d]
module.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[2]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-2023033023132397250000000c]
module.lambda_register.aws_s3_object.lambda_code: Refreshing state... [id=registerFunction-prod/app.zip]
module.lambda_root.aws_s3_object.lambda_code: Refreshing state... [id=rootFunction-prod/app.zip]
aws_s3_object.lambda_auth_code: Refreshing state... [id=authFunction-prod/app.zip]
module.lambda_health.aws_s3_object.lambda_code: Refreshing state... [id=healthFunction-prod/app.zip]
module.lambda_cidr_to_mask.aws_s3_object.lambda_code: Refreshing state... [id=cidrToMaskFunction-prod/app.zip]
module.s3_bucket_for_lambda.aws_s3_bucket_versioning.bucket_versioning: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod]
module.s3_bucket_for_lambda.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod]
module.lambda_mask_to_cidr.aws_s3_object.lambda_code: Refreshing state... [id=maskToCidrFunction-prod/app.zip]
module.lambda_login.aws_s3_object.lambda_code: Refreshing state... [id=loginFunction-prod/app.zip]
module.lambda_health.aws_lambda_function.function: Refreshing state... [id=healthFunction-prod]
module.lambda_cidr_to_mask.aws_lambda_function.function: Refreshing state... [id=cidrToMaskFunction-prod]
aws_lambda_function.lambda_authorizer_function: Refreshing state... [id=authFunction-prod]
module.lambda_mask_to_cidr.aws_lambda_function.function: Refreshing state... [id=maskToCidrFunction-prod]
module.lambda_login.aws_lambda_function.function: Refreshing state... [id=loginFunction-prod]
module.lambda_register.aws_lambda_function.function: Refreshing state... [id=registerFunction-prod]
module.lambda_root.aws_lambda_function.function: Refreshing state... [id=rootFunction-prod]
module.lambda_health.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=7st4jer]
module.lambda_health.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_root.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_root.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=2t6esal]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_authorizer.authorizer: Refreshing state... [id=afmmha]
module.lambda_mask_to_cidr.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=4d1vif9]
module.lambda_mask_to_cidr.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_cidr_to_mask.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=tqqw8yq]
module.lambda_cidr_to_mask.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_login.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_login.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=3a34bge]
module.lambda_register.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.lambda_register.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=81bz5qj]
module.lambda_health.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=92gsdqe]
aws_apigatewayv2_deployment.deployment: Refreshing state... [id=3gql3h]
module.lambda_root.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=pi6sx9e]
module.lambda_mask_to_cidr.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=a6zazam]
module.lambda_cidr_to_mask.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=afcr5d1]
module.lambda_login.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=iv5gfg4]
module.lambda_register.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=hjgx2mu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_deployment.deployment must be replaced
-/+ resource "aws_apigatewayv2_deployment" "deployment" {
      ~ auto_deployed = false -> (known after apply)
      ~ id            = "3gql3h" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "432ec4bab8cd8ccf0a06f9e3871062338ad681d9"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda_authorizer_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_authorizer_function" {
        id                             = "authFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "VqNMfvvJ61DbcHBk205iblaDRPvI2m0cueUV5fIfWnE=" -> "Y+7yZBiYQWvllD+tinzrQUmyI4okcyxw/rMnNMUfYUA="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_auth_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_auth_code" {
      ~ etag                   = "a5c19b191f5bf9aa2d5f1f09a6140f9d" -> "80a5d75bf976b62e8c3b59f79033fd49"
        id                     = "authFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "rtWCd0OuDdavjnWD_5_HLrkOcSlw8qir" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_cidr_to_mask.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "cidrToMaskFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "C0lwD0yc8LqxaiO8EhBIXR2EfW8Rl6nVrlm0WmW4uVU=" -> "wM0QCJkZvpQd3QoRATxWX5MICQ7e2rS6chZ/2GPKU1Y="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_cidr_to_mask.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "4d94e2040362278600ec265eed86857d" -> "9fa5b67c48f2b8ff166362267bb59ab6"
        id                     = "cidrToMaskFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "OrLCjzmc9vOrGteT68dgDP.iyib.A3c7" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_health.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "healthFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:healthFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:healthFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "nFUlHlKEcBEjgSnQwQFud0CtoMlFwUlwNFWEva+w+8g=" -> "/I2qNRCX86JkGR2/vZqBPKdCkK2mWdvCt6NdVLXdFM0="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_health.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "d655469fbe8938ff97b4961da4dbb89d" -> "b80a9139c31953d88d8a60cf3b582bb9"
        id                     = "healthFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "Qaj.BEA9e6vGAkfXpz9VYxjUCMbftOG1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_login.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "loginFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:loginFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:loginFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "in7utDgCGsCu52/FKRZsvQRd83XR9BsPyW1y9XXJRjU=" -> "mDCY0WKcbYKUGmvFGZCDLflUinW55OWuK0ErqjUdNFo="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_login.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "20df2c6458bab15e00fa61cecd5fb0aa" -> "745bb157d4982b097855ca5177925cc1"
        id                     = "loginFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "xG0Jatg7zTZWyLc4aY2k12nvzfRhpnvy" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_mask_to_cidr.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "maskToCidrFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "vT+DKOQovroDHPmPq84a7l03mzNAwGXA8odOFTqvjHA=" -> "YyrGt2Pj+TReW7fKZpdFP24/YCfRACfo0A/0IGtBt3s="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_mask_to_cidr.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "69bf75ae9086987ae2a39d5e844638fc" -> "b0a732a80d658074fac0eadd9ac50763"
        id                     = "maskToCidrFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "ATr_d3JoypjNDetj4uxf_1jF43P_smXr" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_register.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "registerFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:registerFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:registerFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "VBuNjjAd9qmT6Klj9hqmvM+0r7WRJ6Oounkxmpe82KY=" -> "QyHgkoMUUu6NxbUrgAdIcOha72ziPm58zNxoD7qs5H8="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_register.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "8fd032b6f821a58d3a284d0ae9124bd6" -> "719052b2bb4d42ab5cb206515326d1cc"
        id                     = "registerFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "MeYcRm99DB8GlKv9qOgfXC9eUGP6qeKp" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.lambda_root.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "rootFunction-prod"
      ~ last_modified                  = "2023-03-31T02:00:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:408257009451:function:rootFunction-prod:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:rootFunction-prod:18/invocations" -> (known after apply)
      ~ source_code_hash               = "AS//YXIhCXCUjJ2Gt8TAZMy04yB0+1cg6tZLFuJF0p0=" -> "QvnJyZf4cRLFyi0IafHgcJQqwaD4TKcG2KISsL+B/m0="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_root.aws_s3_object.lambda_code will be updated in-place
  ~ resource "aws_s3_object" "lambda_code" {
      ~ etag                   = "fb5519043dfd83b45d557d3a03116108" -> "56aa4d2824cc9a8fb5a3aef661851662"
        id                     = "rootFunction-prod/app.zip"
        tags                   = {}
      ~ version_id             = "fqmEpC5mAsIz136wlpJSgex41teRgysh" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 14 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @trujillo9616, Action: `pull_request`*